Repository: rongem/dbi
Catalog: frontend/src/locale/messages.*.xlf
Languages: de

source: Database-Importer v
de: Datenbank-Importer v

source: Clear error
de: Fehler ausblenden

source: You don't have sufficient rights to import into database.
de: Sie verfügen nicht über das Recht, Daten in die Datenbank zu importieren.

source: Working...
de: Beschäftigt...

source: This line contains data causing errors.
de: Diese Zeile entält Daten, die Fehler verursachen.

source: An error occured
de: Es ist ein Fehler aufgetreten

source: Missing cell content
de: Kein Inhalt für die Zelle vorhanden

source: Missing column definition for
de: Es fehlt eine Spaltendefinition für

source: Nulls and empty values are not allowed.
de: Null bzw. leere Werte sind nicht gestattet.

source: Number expected
de: Es wird eine Zahl erwartet

source: Date expected
de: Es wird ein Datum erwartet

source: Boolean expected
de: Es wird ein boolescher Wert erwartet

source: String expected
de: Es wird ein String (Text) erwartet

source: Column:
de: Spalte:

source: Database schemas
de: Datenbank-Schemas

source: The database contains multiple schemas. Tables exist in each schema, and they will be displayed after you have selected a schema. If you have any questions about schemas or tables, please ask your database administrator.
de: Die Datenbank enthält mehrere Schemas. In jedem Schema existieren Tabellen, die angezeigt werden, nachdem Sie ein Schema ausgewählt haben. Wenn Sie Fragen zu Schemas oder Tabellen haben, fragen Sie Ihren Datenbank-Administrator.

source: Home
de: Oberste Ebene

source: Successfully imported
de: Es wurden

source: rows.
de: Zeilen erfolgreich importiert.

source: After copying your table content to clipboard, paste it here with Ctrl + V.
de: Nachdem Sie Ihre Tabelle in die Zwischenablage kopiert haben, können Sie sie hier mit Strg + V einfügen.

source: Replace data here with Ctrl + V.
de: Sie können Daten mit Strg + V ersetzen.

source: Start import
de: Import starten

source: This column is used for the primary key of the table.
de: Diese Spalte wird für den Primärschlüssel der Tabelle verwendet.

source: This column contains a foreign key pointing to another table.
de: Diese Spalte enthät einen Fremdschlüssel, der auf eine andere Tabelle verweist.

source: This column must contain unique entries.
de: Diese Spalte muss eindeutige Werte enthalten.

source: Primary key
de: Primärschlüssel

source: Foreign key
de: Fremdschlüssel

source: Unique constraint
de: Eineutigkeitsregel

source: Default value present
de: Standardwert vorhanden

source: Null values allowed
de: Null zugelassen

source: Allowed Data Types:
de: Erlaubte Datentypen:
